#include <iostream> // Подключаем библиотеку ввода и вывода
using namespace std; // Используем пространство имен std
void numUp( int *a, int *b, int *c); //Обьявляем функцию до main, но прячем ее после main для удобства чтения
int main() {
    int a, b , c;
    cout << "Введите ваши числа: "; // Выводим надпись 
    cin >> a >> b >> c;
    numUp(&a, &b, &c);
    cout << "1 Число: " << a << endl; // Выводим уже увеличенные
    cout << "2 Число: " << b << endl;
    cout << "3 Число: " << c << endl;
    return 0;
    }
    //Функция меняет значение самих переменных тотально во всем Main, а не лишь в функции numUp
void numUp( int *a, int *b, int *c){
    if(*a == *b || *a == *c || *b == *c) { // Тут записаны условия через логическое "ИЛИ" ||)
        *a += 5; //Увеличиваем каждое число на 5
        *b += 5;
        *c += 5;
    }
    else
        cout << "Равных чисел нет!" << endl; // Выводим если равных нет
}