#include <iostream> // Подключаем библиотеку ввода и вывода
using namespace std; // Используем пространство имен std

int main() { // Создаем функцию main
    int Z; // Обьявляем число Z и тип переменной
    cout << "Введите ваше пятизначное число: "; // Выводим надпись 
    cin >> Z; // Вводим число
    int z1 = Z / 10000; //Делим на 10000 целочисленно(Как и все следующие шаги) чтобы найти первую цифру(Например 18343 / 10000 = 1)
    int z2 = (Z / 1000) % 10; //Делим сначало на 1000(18343 / 1000 = 18), а затем остаток от деления на 10(18 % 10 = 8)
    int z3 = (Z / 100) % 10; //Делим на 100(18343 / 100 = 183), и так же на 10(183 % 10 = 3)
    int z4 = (Z / 10) % 10; // Делим на 10(18343 / 10 = 1834), и на 10(1834 % 10 = 4)
    int z5 = Z % 10; //Ищем последнее число(18343 %  10 = 3)
    cout << "Первая цифра: " << z1 << endl 
    << "Вторая цифра: " << z2 << endl 
    << "Третья цифра: " << z3 << endl 
    << "Четвертая цифра: " << z4 << endl 
    << "Пятая цифра: " << z5 << endl; //Выводим каждое на новой строке
return 0;
}
